In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

dataset = pd.read_csv("Toyota.csv")
dataset.head(5)

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

In [3]:
dataset.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [4]:
dataset.select_dtypes(include="float64").columns

Index(['Age', 'MetColor'], dtype='object')

In [5]:
from sklearn.impute import SimpleImputer

si = SimpleImputer(strategy="mean")     # FILLS MEAN VALUE IN PLACE OF MISSING VALUE IN COLUMNS
ar = si.fit_transform(dataset[['Age', 'MetColor']])

In [7]:
new_dataset = pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)
new_dataset.isnull().sum()     # Missing data is filled

Age         0
MetColor    0
dtype: int64

In [8]:
new_dataset

            Age  MetColor
0     23.000000  1.000000
1     23.000000  1.000000
2     24.000000  0.674961
3     26.000000  0.000000
4     30.000000  0.000000
...         ...       ...
1431  55.672156  1.000000
1432  72.000000  0.000000
1433  55.672156  0.000000
1434  70.000000  1.000000
1435  76.000000  0.000000

[1436 rows x 2 columns]

In [9]:
dataset["Age"].mean()

55.67215568862275

In [11]:
dataset["MetColor"].mean()

0.6749611197511665